# Introduction

## Original Dataset Description
"This is a transnational data set which contains all the transactions occurring between 01/12/2010 and 09/12/2011 for a UK-based and registered non-store online retail.The company mainly sells unique all-occasion gifts. Many customers of the company are wholesalers."

##### Business Question
Generate a time series forecast for the monthly sales of the top 5 most saled products.

## Potential Challenges
-  Only one-year data: seasonality matters
-  Stationarity: Most of the time series models work on the assumption that the time series is stationary

# Data Preprocessing

## Dataset overview

In [191]:
# import packages
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"
pd.set_option('mode.chained_assignment', None)

In [192]:
# read data
df_raw=pd.read_csv('data.csv',encoding="ISO-8859-1")
# show first and last 5 rows of data
df_raw.head()
df_raw.tail()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France

In [193]:
# data types and basic statistics
df_raw.dtypes
df_raw.describe()

InvoiceNo       object
StockCode       object
Description     object
Quantity         int64
InvoiceDate     object
UnitPrice      float64
CustomerID     float64
Country         object
dtype: object

            Quantity      UnitPrice     CustomerID
count  541909.000000  541909.000000  406829.000000
mean        9.552250       4.611114   15287.690570
std       218.081158      96.759853    1713.600303
min    -80995.000000  -11062.060000   12346.000000
25%         1.000000       1.250000   13953.000000
50%         3.000000       2.080000   15152.000000
75%        10.000000       4.130000   16791.000000
max     80995.000000   38970.000000   18287.000000

## Data Preparation
According to the work done by F. Daniel in https://www.kaggle.com/fabiendaniel/customer-segmentation, this dataframe contains 8 variables: InvoiceNo, StockCode, Description, Quantity, InvoiceDate, UnitPrice, CustomerID, and Country. <br>
**InvoiceNo**: Invoice number. Nominal, a 6-digit integral number uniquely assigned to each transaction.  If this code starts with letter 'C', it indicates a cancellation. If this code starts with letter 'A', it indicates a bad debt. <br>
**StockCode**: Product (item) code. Nominal, a 5-digit integral number uniquely assigned to each distinct product. <br>
**Description**: Product (item) name. Nominal. <br>
**Quantity**: The quantities of each product (item) per transaction. Numeric.	<br>
**InvoiceDate**: Invice Date and time. Numeric, the day and time when each transaction was generated. <br>
**UnitPrice**: Unit price. Numeric, Product price per unit in sterling. <br>
**CustomerID**: Customer number. Nominal, a 5-digit integral number uniquely assigned to each customer. <br>
**Country**: Country name. Nominal, the name of the country where each customer resides.<br>

### Drop duplications

In [194]:
print('Number of duplicated transactions: ',df_raw.duplicated().sum())
df=df_raw.drop_duplicates()

Number of duplicated transactions:  5268

### Missing values

In [195]:
# fill out missing customerID with 0
df['CustomerID']=df['CustomerID'].fillna(0)

### InvoiceDate
In order to apply a time series analysis, we convert the data type of **InvoiceDate** to *datetime* and only keep the date.

In [196]:
df['InvoiceDate']=pd.to_datetime(df['InvoiceDate']).dt.date

### Special transactions

We notice some of the transactions have negative quantities and 0 unitprices.

In [197]:
print('Number of transactions that have negative quantities:', len(df[df['Quantity']<0]))
print('Number of transactions that have zero unitprices:', len(df[df['UnitPrice']==0]))

Number of transactions that have negative quantities: 10587
Number of transactions that have zero unitprices: 2510

These transactions are special transactions, which need extra attention. Some of these orders have speical letters in their InoiceNo.

In [198]:
df['InvoiceNo'].str[0].value_counts()

5    527387
C      9251
A         3
Name: InvoiceNo, dtype: int64

We can see there are 9254 (9251+3) transactions' InoviceNos start with a letter, either "C" or "A". 2510 transactions' unitPrices are zero. Let's take a closer look at these transactions.

In [199]:
df[df['InvoiceNo'].str[0]=='C'].head()
df[df['InvoiceNo'].str[0]=='A'].head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
141,C536379,D,Discount,-1,2010-12-01,27.50,14527.0,United Kingdom
154,C536383,35004C,SET OF 3 COLOURED FLYING DUCKS,-1,2010-12-01,4.65,15311.0,United Kingdom
235,C536391,22556,PLASTERS IN TIN CIRCUS PARADE,-12,2010-12-01,1.65,17548.0,United Kingdom
236,C536391,21984,PACK OF 12 PINK PAISLEY TISSUES,-24,2010-12-01,0.29,17548.0,United Kingdom
237,C536391,21983,PACK OF 12 BLUE PAISLEY TISSUES,-24,2010-12-01,0.29,17548.0,United Kingdom

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
299982,A563185,B,Adjust bad debt,1,2011-08-12,11062.06,0.0,United Kingdom
299983,A563186,B,Adjust bad debt,1,2011-08-12,-11062.06,0.0,United Kingdom
299984,A563187,B,Adjust bad debt,1,2011-08-12,-11062.06,0.0,United Kingdom

Appearently, if this code starts with letter 'C', it indicates a cancellation. If this code starts with letter 'A', it indicates an adjust bad debt.

#### Adjust bad debt
I simply remove these three transactions.

In [200]:
df=df[df['InvoiceNo'].str[0]!='A']

#### Discount

Some of the cancellations are due to discount.

In [201]:
df_discount=df[df['StockCode']=='D']
df_discount.head()
print('Number of discount transactions:', len(df_discount))

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
141,C536379,D,Discount,-1,2010-12-01,27.50,14527.0,United Kingdom
9038,C537164,D,Discount,-1,2010-12-05,29.29,14527.0,United Kingdom
14498,C537597,D,Discount,-1,2010-12-07,281.00,15498.0,United Kingdom
19392,C537857,D,Discount,-1,2010-12-08,267.12,17340.0,United Kingdom
31134,C538897,D,Discount,-1,2010-12-15,5.76,16422.0,United Kingdom

Number of discount transactions: 77

Without losing generality, I just remove these transactions.

In [202]:
df=df[df['StockCode']!='D']

#### Cancellation

As for a cancellation, what I will do is to remove both the cancellation and its original order from the dataset. Here, the original order coresponds to a cancellation is determined by finding the closest order that has the same **StockCode**, **Description**, **UnitPrice**, **CustomerID**, **Country** and **Quantity** (but positive). Note that some cancellations' original orders may not be included in this dataset, which probably because these orders were placed before 12/01/2010.

In [203]:
# extract all cancellations to a new dataframe df_cancel and remove these transactions from df
df_cancel=df[df['InvoiceNo'].str[0]=='C']
df=df[df['InvoiceNo'].str[0]!='C']
# remove the intial "C" letter for all the cancellations and change the quantity from negative to positive
df_cancel['InvoiceNo']=df_cancel['InvoiceNo'].str[1:]
df_cancel['Quantity']=-df_cancel['Quantity']
df_cancel.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
154,536383,35004C,SET OF 3 COLOURED FLYING DUCKS,1,2010-12-01,4.65,15311.0,United Kingdom
235,536391,22556,PLASTERS IN TIN CIRCUS PARADE,12,2010-12-01,1.65,17548.0,United Kingdom
236,536391,21984,PACK OF 12 PINK PAISLEY TISSUES,24,2010-12-01,0.29,17548.0,United Kingdom
237,536391,21983,PACK OF 12 BLUE PAISLEY TISSUES,24,2010-12-01,0.29,17548.0,United Kingdom
238,536391,21980,PACK OF 12 RED RETROSPOT TISSUES,24,2010-12-01,0.29,17548.0,United Kingdom

Now the **InvoiceNo** column for both *df* and *df_cancel* only contain intergral numbers, so they can be converted to numerics.

In [204]:
df['InvoiceNo']=df['InvoiceNo'].astype('int32')
df_cancel['InvoiceNo']=df_cancel['InvoiceNo'].astype('int32')

Then we can merge *df* and *df_cancel* based on **StockCode**, **Description**, **UnitPrice**, **CustomerID**, **Country** and **Quantity** from *df_cancel* and drop the cancellations that cannot find original orders in *df*. Also, we only keep the orders that were placed before the corresponding cancellation.

In [205]:
df_origin_canditates=df.reset_index().merge(df_cancel,how='right',
                              on=['StockCode', 'Description','Quantity','UnitPrice','CustomerID','Country']).set_index('index')
df_origin_canditates.dropna(axis = 0, subset = ['InvoiceNo_x'], inplace = True)
df_origin_canditates=df_origin_canditates.loc[lambda x: x['InvoiceNo_x']<x['InvoiceNo_y']]
df_origin_canditates.head()
print('number of all possible original orders:',len(df_origin_canditates))

,InvoiceNo_x,StockCode,Description,Quantity,InvoiceDate_x,UnitPrice,CustomerID,Country,InvoiceNo_y,InvoiceDate_y
index,,,,,,,,,,
55.0,536373.0,21071,VINTAGE BILLBOARD DRINK ME MUG,6,2010-12-01,1.06,17850.0,United Kingdom,543611,2011-02-10
72.0,536375.0,21071,VINTAGE BILLBOARD DRINK ME MUG,6,2010-12-01,1.06,17850.0,United Kingdom,543611,2011-02-10
285.0,536396.0,21071,VINTAGE BILLBOARD DRINK ME MUG,6,2010-12-01,1.06,17850.0,United Kingdom,543611,2011-02-10
422.0,536406.0,21071,VINTAGE BILLBOARD DRINK ME MUG,6,2010-12-01,1.06,17850.0,United Kingdom,543611,2011-02-10
3134.0,536602.0,21071,VINTAGE BILLBOARD DRINK ME MUG,6,2010-12-02,1.06,17850.0,United Kingdom,543611,2011-02-10

number of all possible original orders: 4138

Then we can select the latest order among the possible original orders for each cancellation.

In [206]:
df_origin = df_origin_canditates[df_origin_canditates.groupby(['InvoiceNo_y'])['InvoiceNo_x'].transform(max) == df_origin_canditates['InvoiceNo_x']]
df_origin.head()
print('Number of orginal orders: ', len(set(df_origin.index)))

,InvoiceNo_x,StockCode,Description,Quantity,InvoiceDate_x,UnitPrice,CustomerID,Country,InvoiceNo_y,InvoiceDate_y
index,,,,,,,,,,
4515.0,536787.0,21071,VINTAGE BILLBOARD DRINK ME MUG,6,2010-12-02,1.06,17850.0,United Kingdom,543611,2011-02-10
24199.0,538343.0,22114,HOT WATER BOTTLE TEA AND SYMPATHY,4,2010-12-10,3.95,13448.0,United Kingdom,538670,2010-12-13
109089.0,545582.0,21154,RED RETROSPOT OVEN GLOVE,200,2011-03-04,1.06,13694.0,United Kingdom,548577,2011-04-01
1312.0,536533.0,22680,FRENCH BLUE METAL DOOR SIGN 5,20,2010-12-01,1.25,16955.0,United Kingdom,538725,2010-12-14
42332.0,539984.0,C2,CARRIAGE,1,2010-12-23,50.00,14911.0,EIRE,540164,2011-01-05

Number of orginal orders:  2497

Next, we remove these orders from *df*.

In [207]:
df=df[~df.index.isin(set(df_origin.index))]

In [208]:
df[df['UnitPrice']==0].head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
622,536414,22139,NaN,56,2010-12-01,0.0,0.0,United Kingdom
1970,536545,21134,NaN,1,2010-12-01,0.0,0.0,United Kingdom
1971,536546,22145,NaN,1,2010-12-01,0.0,0.0,United Kingdom
1972,536547,37509,NaN,1,2010-12-01,0.0,0.0,United Kingdom
1987,536549,85226A,NaN,1,2010-12-01,0.0,0.0,United Kingdom

#### Return

There are still some transactions that have negative quantities and zero unit prices, which are corresponding to return orders. Similarily, we just simply remove these transactions.

In [209]:
df_return=df[(df['Quantity']<0)&(df['UnitPrice']==0)]
df_return.head()
df=df[~((df['Quantity']<0)&(df['UnitPrice']==0))]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
2406,536589,21777,NaN,-10,2010-12-01,0.0,0.0,United Kingdom
4347,536764,84952C,NaN,-38,2010-12-02,0.0,0.0,United Kingdom
7188,536996,22712,NaN,-20,2010-12-03,0.0,0.0,United Kingdom
7189,536997,22028,NaN,-20,2010-12-03,0.0,0.0,United Kingdom
7190,536998,85067,NaN,-6,2010-12-03,0.0,0.0,United Kingdom

524890

523554

#### Other adjustments

In [214]:
df_other=df[df['UnitPrice']==0]
df_other.head()
len(df_other)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
622,536414,22139,NaN,56,2010-12-01,0.0,0.0,United Kingdom
1970,536545,21134,NaN,1,2010-12-01,0.0,0.0,United Kingdom
1971,536546,22145,NaN,1,2010-12-01,0.0,0.0,United Kingdom
1972,536547,37509,NaN,1,2010-12-01,0.0,0.0,United Kingdom
1987,536549,85226A,NaN,1,2010-12-01,0.0,0.0,United Kingdom

1156

In [217]:
list(df_other['Description'].value_counts().index)

['check',
 'found',
 'adjustment',
 'FRENCH BLUE METAL DOOR SIGN 1',
 'amazon',
 'FRENCH BLUE METAL DOOR SIGN 8',
 'Found',
 'RECIPE BOX PANTRY YELLOW DESIGN',
 'OWL DOORSTOP',
 'Amazon',
 'FRENCH BLUE METAL DOOR SIGN 4',
 'FRENCH BLUE METAL DOOR SIGN 3',
 'FRENCH BLUE METAL DOOR SIGN No',
 'FRENCH BLUE METAL DOOR SIGN 6',
 'FRENCH BLUE METAL DOOR SIGN 7',
 '?',
 'RED KITCHEN SCALES',
 'FRENCH BLUE METAL DOOR SIGN 5',
 'FRENCH BLUE METAL DOOR SIGN 0',
 'POLYESTER FILLER PAD 45x45cm',
 'RED RETROSPOT CHARLOTTE BAG',
 'BOX OF 24 COCKTAIL PARASOLS',
 'FRENCH BLUE METAL DOOR SIGN 2',
 'DOORMAT WELCOME TO OUR HOME',
 'MINT KITCHEN SCALES',
 'RECIPE BOX BLUE SKETCHBOOK DESIGN',
 'had been put aside',
 'CHILDS GARDEN SPADE BLUE',
 'FRENCH BLUE METAL DOOR SIGN 9',
 'POLYESTER FILLER PAD 40x40cm',
 'DOORMAT ENGLISH ROSE ',
 'GLASS JAR DIGESTIVE BISCUITS',
 'CHILDRENS GARDEN GLOVES BLUE',
 'ENAMEL WATERING CAN CREAM',
 'GLASS JAR KINGS CHOICE',
 'BLACK KITCHEN SCALES',
 'WHITE HANGING HEART T-LIGHT HOLDER',
 'GLASS JAR PEACOCK BATH SALTS',
 'dotcom',
 'IVORY KITCHEN SCALES',
 'KINGS CHOICE BISCUIT TIN',
 'SET OF 6 SOLDIER SKITTLES',
 'HOLIDAY FUN LUDO',
 'AIRLINE BAG VINTAGE JET SET BROWN',
 'Manual',
 'DOORMAT AIRMAIL ',
 'AMAZON',
 'COFFEE MUG CAT + BIRD DESIGN',
 'ENAMEL FLOWER JUG CREAM',
 'mailout',
 'STRAWBERRY FAIRY CAKE TEAPOT',
 'DOORMAT RESPECTABLE HOUSE',
 'RED RETROSPOT CHILDRENS UMBRELLA',
 'GLASS JAR ENGLISH CONFECTIONERY',
 'AIRLINE BAG VINTAGE WORLD CHAMPION ',
 'AIRLINE BAG VINTAGE TOKYO 78',
 'CHILDS GARDEN SPADE PINK',
 'ILLUSTRATED CAT BOWL ',
 'GLASS JAR MARMALADE ',
 'DOORMAT NEIGHBOURHOOD WITCH ',
 'JUMBO BAG RED RETROSPOT',
 'JUMBO BAG STRAWBERRY',
 'CHILLI LIGHTS',
 'CHILDS GARDEN TROWEL BLUE ',
 'AIRLINE BAG VINTAGE JET SET RED',
 'CHARLOTTE BAG PINK POLKADOT',
 'BLUE POLKADOT PASSPORT COVER',
 'CHILDS GARDEN BRUSH BLUE',
 'SET OF 16 VINTAGE BLACK CUTLERY',
 'SKULL DESIGN TV DINNER TRAY',
 'BLUE POLKADOT LUGGAGE TAG ',
 'SEASIDE FLYING DISC',
 'Adjustment',
 'CERAMIC STRAWBERRY CAKE MONEY BANK',
 'SPACEBOY TV DINNER TRAY',
 'CHILDRENS APRON SPACEBOY DESIGN',
 'test',
 'TEATIME FUNKY FLOWER BACKPACK FOR 2',
 'BINGO SET',
 'ENAMEL WASH BOWL CREAM',
 'CERAMIC STRAWBERRY MONEY BOX',
 'WATERING CAN BLUE ELEPHANT',
 'CHILDS GARDEN BRUSH PINK',
 'ROUND SNACK BOXES SET OF 4 SKULLS',
 'BISCUIT TIN VINTAGE GREEN',
 'SPOTTY BUNTING',
 'VINTAGE SNAKES & LADDERS',
 'taig adjust',
 'returned',
 'DOTCOM POSTAGE',
 'PORCELAIN BUTTERFLY OIL BURNER',
 'STRAWBERRY LUNCH BOX WITH CUTLERY',
 'WOODLAND CHARLOTTE BAG',
 'PICNIC BASKET WICKER LARGE',
 'TV DINNER TRAY VINTAGE PAISLEY',
 'RETRO "TEA FOR ONE" ',
 'ENAMEL FIRE BUCKET CREAM',
 'WHEELBARROW FOR CHILDREN ',
 'GLASS JAR DAISY FRESH COTTON WOOL',
 'GREEN REGENCY TEACUP AND SAUCER',
 'CHOCOLATE HOT WATER BOTTLE',
 'WATERING CAN PINK BUNNY',
 'PINK REGENCY TEACUP AND SAUCER',
 'MILK PAN PINK POLKADOT',
 'CHILDS GARDEN FORK BLUE ',
 'CHILDS GARDEN RAKE BLUE',
 'REGENCY CAKESTAND 3 TIER',
 'SET OF 9 BLACK SKULL BALLOONS',
 'LUNCH BAG WOODLAND',
 'amazon adjust',
 'BISCUIT TIN VINTAGE RED',
 'BAKING SET SPACEBOY DESIGN',
 'Marked as 23343',
 "CHILDREN'S APRON DOLLY GIRL ",
 'CHRISTMAS PUDDING TRINKET POT ',
 'ZINC WILLIE WINKIE  CANDLE STICK',
 'HEART GARLAND RUSTIC PADDED',
 'wrongly coded 23343',
 'website fixed',
 'PASTEL COLOUR HONEYCOMB FAN',
 'KEY FOB , BACK DOOR ',
 'check?',
 'RED RETROSPOT SUGAR JAM BOWL',
 'to push order througha s stock was ',
 'MILK PAN RED RETROSPOT',
 'BLACK MINI TAPE MEASURE ',
 'michel oops',
 'JUMBO BAG TOYS ',
 'WOODEN BOX OF DOMINOES',
 'FAIRY CAKES NOTEBOOK A6 SIZE',
 'EMPIRE UNION JACK TV DINNER TRAY',
 'incorrectly credited C550456 see 47',
 'CERAMIC CHERRY CAKE MONEY BANK',
 'FRYING PAN BLUE POLKADOT',
 'GARAGE KEY FOB',
 'JUMBO BAG SPACEBOY DESIGN',
 'HEART OF WICKER LARGE',
 'came coded as 20713',
 'WHITE SKULL HOT WATER BOTTLE ',
 'ORGANISER WOOD ANTIQUE WHITE ',
 'DOORMAT MERRY CHRISTMAS RED ',
 'allocate stock for dotcom orders ta',
 'PAPER BUNTING RETROSPOT',
 'on cargo order',
 '4 TRADITIONAL SPINNING TOPS',
 'TOY TIDY SPACEBOY  ',
 'FAWN BLUE HOT WATER BOTTLE',
 'DOORMAT 3 SMILEY CATS',
 'PACK OF 12 LONDON TISSUES ',
 'CERAMIC PIRATE CHEST MONEY BANK',
 'PICNIC BASKET WICKER SMALL',
 'VICTORIAN SEWING BOX LARGE',
 'ASSTD MULTICOLOUR CIRCLES MUG',
 'dotcomstock',
 'wrongly marked',
 'John Lewis',
 'Found by jackie',
 'did  a credit  and did not tick ret',
 'RED RETROSPOT BUTTER DISH',
 'add stock to allocate online orders',
 'Lighthouse Trading zero invc incorr',
 'DOORMAT HOME SWEET HOME BLUE ',
 'AIRLINE BAG VINTAGE JET SET WHITE',
 'PADS TO MATCH ALL CUSHIONS',
 'CLASSIC GLASS COOKIE JAR',
 'CHILDRENS GARDEN GLOVES PINK',
 'alan hodge cant mamage this section',
 'Had been put aside.',
 'PIGGY BANK RETROSPOT ',
 'HANGING METAL HEART LANTERN',
 'found box',
 'HOT WATER BOTTLE TEA AND SYMPATHY',
 'wrongly sold (22719) barcode',
 'FBA',
 'ADVENT CALENDAR GINGHAM SACK',
 'TOADSTOOL MONEY BOX',
 'LUNCH BOX WITH CUTLERY FAIRY CAKES ',
 'MINI CAKE STAND  HANGING STRAWBERY',
 'PARTY BUNTING',
 'TV DINNER TRAY DOLLY GIRL',
 'rcvd be air temp fix for dotcom sit',
 'CERAMIC LOVE HEART MONEY BANK',
 'KEY FOB , SHED',
 'DINOSAUR LUNCH BOX WITH CUTLERY',
 'wrongly coded 20713',
 'SET OF 20 KIDS COOKIE CUTTERS',
 'Sale error',
 'wrongly marked 23343',
 'CERAMIC HEART FAIRY CAKE MONEY BANK',
 'PACK OF 6 BIRDY GIFT TAGS',
 'FOUND',
 'DOORMAT HEARTS',
 'WHITE SPOT BLUE CERAMIC DRAWER KNOB',
 'TRAVEL SEWING KIT',
 'CIRCUS PARADE LUNCH BOX ',
 'amazon sales',
 'FULL ENGLISH BREAKFAST PLATE',
 'Found in w/hse',
 'PARTY METAL SIGN ',
 'CHICK GREY HOT WATER BOTTLE',
 ' OVAL WALL MIRROR DIAMANTE ',
 'CREAM SWEETHEART LETTER RACK',
 'UNION STRIPE WITH FRINGE  HAMMOCK',
 'VINTAGE HEADS AND TAILS CARD GAME ',
 'TRAVEL CARD WALLET DOTCOMGIFTSHOP',
 'TRADITIONAL WOODEN SKIPPING ROPE',
 'for online retail orders',
 'CHILDS GARDEN TROWEL PINK',
 'ROSES REGENCY TEACUP AND SAUCER ',
 'PLASTERS IN TIN SKULLS',
 'dotcom adjust',
 'SET/20 RED RETROSPOT PAPER NAPKINS ',
 'FRIDGE MAGNETS LES ENFANTS ASSORTED',
 'MINI LIGHTS WOODLAND MUSHROOMS',
 'PAPER BUNTING VINTAGE PAISLEY',
 'mailout ',
 'ASSTD DESIGN 3D PAPER STICKERS',
 'PINK DOUGHNUT TRINKET POT ',
 'Amazon Adjustment',
 'RED RETROSPOT TEA CUP AND SAUCER ',
 'GLASS CLOCHE SMALL',
 'LUNCH BAG SUKI DESIGN ',
 'ENAMEL COLANDER CREAM',
 'CERAMIC BOWL WITH LOVE HEART DESIGN',
 'COFFEE MUG DOG + BALL DESIGN',
 'DOORMAT RED RETROSPOT',
 'damaged',
 'BOX OF VINTAGE JIGSAW BLOCKS ',
 'DOORSTOP RACING CAR DESIGN',
 'GROW YOUR OWN PLANT IN A CAN ',
 'BLUE SPOT CERAMIC DRAWER KNOB',
 'STRAWBERRY CERAMIC TRINKET BOX',
 'BOX OF 6 ASSORTED COLOUR TEASPOONS',
 'KEY FOB , GARAGE DESIGN',
 'CHILDS GARDEN FORK PINK']

### Country

Check the data distribution across different countries.

In [210]:
countries = df['Country'].value_counts()
countries.apply(lambda x:x/len(df)*100).head()

United Kingdom    91.520836
Germany            1.712335
France             1.590476
EIRE               1.482369
Spain              0.469102
Name: Country, dtype: float64

We can see about 91% of the data are from UK. In the following, in order to achieve more accurate time series results, we only focus on the orders from UK.

In [211]:
df=df[df['Country']=='United Kingdom']

### Data aggregation

Create a disctionary maping each **StockCode** to its **Description**.

In [212]:
Code_Descrip=pd.Series(df['Description'].values,index=df['StockCode']).to_dict()

Find the most saled products.

In [213]:
top_sale=df['StockCode'].value_counts().head()
top_sale
[Code_Descrip[x] for x in list(top_sale.index)]

85123A    2155
85099B    1949
22423     1674
47566     1599
20725     1403
Name: StockCode, dtype: int64

['CREAM HANGING HEART T-LIGHT HOLDER',
 'JUMBO BAG RED RETROSPOT',
 'REGENCY CAKESTAND 3 TIER',
 'PARTY BUNTING',
 'LUNCH BAG RED RETROSPOT']

Therefore, there are 9288 transactions are cancelled and 2515 transactions are returned.